---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateCurveBasedFamily
source: html/4fddd8eb-c845-d03f-8f9c-edc3c142dced.htm
---
# Autodesk.Revit.DB.BuiltInFailures.InaccurateFailures.InaccurateCurveBasedFamily Property

Curve-Based Family is slightly off axis and may cause inaccuracies.

## Syntax (C#)
```csharp
public static FailureDefinitionId InaccurateCurveBasedFamily { get; }
```